 
#!/bin/bash  
#  
#下面是字体输出颜色及终端格式控制  
#字体色30-37  
echo -e "\033[30m黑色字\033[0m"  
echo -e "\033[31m红色字\033[0m"  
echo -e "\033[32m绿色字\033[0m"  
echo -e "\033[33m黄色字\033[0m"  
echo -e "\033[34m蓝色字\033[0m"  
echo -e "\033[35m紫色字\033[0m"  
echo -e "\033[36m天蓝字\033[0m"  
echo -e "\033[37m白色字\033[0m"  
  
#字背景颜色范围:40-47  
echo -e "\033[40;37m黑底白字\033[0m"  
echo -e "\033[41;30m红底黑字\033[0m"  
echo -e "\033[42;34m绿底蓝字\033[0m"  
echo -e "\033[43;34m黄底蓝字\033[0m"  
echo -e "\033[44;30m蓝底黑字\033[0m"  
echo -e "\033[45;30m紫底黑字\033[0m"  
echo -e "\033[46;30m天蓝底黑字\033[0m"  
echo -e "\033[47;34m白底蓝字\033[0m" 